# Criando os nomes

In [1]:
import pandas as pd

In [2]:
nomes_f = pd.read_json('https://servicodados.ibge.gov.br/api/v1/censos/nomes/ranking?qtd=200&sexo=f')
nomes_m = pd.read_json('https://servicodados.ibge.gov.br/api/v1/censos/nomes/ranking?qtd=200&sexo=m')

In [3]:
print('Quantidade de nomes: ' + str(len(nomes_m) + len(nomes_f)))

Quantidade de nomes: 400

In [4]:
frames = [nomes_f, nomes_m]

In [5]:
nomes = pd.concat(frames)['nome'].to_frame()

In [6]:
nomes.sample(3)

        nome
186     INES
138    NEUSA
19   MARIANA

# Incluindo ID dos alunos

In [7]:
import numpy as np
np.random.seed(123)

In [8]:
total_alunos = len(nomes)
total_alunos

400

In [9]:
nomes['id aluno'] = np.random.permutation(total_alunos) + 1

In [10]:
nomes.sample(5)

          nome  id aluno
188    POLIANA       369
57      DAIANE       303
3    FRANCISCO       382
182    CHARLES        33
30    ANDERSON       111

In [11]:
dominios = ['@dominioemail.com.br', '@servicoemail.com']
nomes['dominio'] = np.random.choice(dominios, total_alunos)
nomes.sample(5)

          nome  id aluno               dominio
84    SEVERINO        78  @dominioemail.com.br
0         JOSE       331     @servicoemail.com
179       IAGO       340  @dominioemail.com.br
10      SANDRA       174  @dominioemail.com.br
171  TERESINHA        45  @dominioemail.com.br

In [12]:
nomes['email'] = nomes.nome.str.cat(nomes.dominio).str.lower()

In [13]:
nomes.sample(5)

       nome  id aluno               dominio                       email
114  ARTHUR       320  @dominioemail.com.br  arthur@dominioemail.com.br
57   DAIANE       303     @servicoemail.com     daiane@servicoemail.com
85   HELENA       221  @dominioemail.com.br  helena@dominioemail.com.br
183   IRACI         8  @dominioemail.com.br   iraci@dominioemail.com.br
189   DALVA       137  @dominioemail.com.br   dalva@dominioemail.com.br

# Criando a tabela Cursos

In [14]:
import html5lib

In [18]:
url = 'http://tabela-cursos.herokuapp.com/index.html'
cursos = pd.read_html(url)
cursos

[                          Nome do curso
 0                 Lógica de programação
 1                         Java para Web
 2                           C# para Web
 3                         Ruby on Rails
 4                      Cursos de Python
 5                         PHP com MySql
 6                         .NET para web
 7            Novas integrações com Java
 8                          TDD com Java
 9                   Código limpo com C#
 10  Preparatório para certificação Java
 11                      Hardware básico
 12                Persistência com .NET
 13                  Desenvolvendo jogos
 14                     Análise de dados
 15                   Estatística básica
 16                  Internet das coisas
 17                Programação funcional
 18                Boas práticas em Java
 19          Orientação objetos com Java]

In [19]:
type(cursos)

list

#### cursos[0] é usado para transformar a lista cursos em um Data Frame

In [21]:
cursos = cursos[0]
type(cursos)

pandas.core.frame.DataFrame

In [23]:
cursos.head()

           Nome do curso
0  Lógica de programação
1          Java para Web
2            C# para Web
3          Ruby on Rails
4       Cursos de Python